Revit 2027 API
MEPSystem.Remove(ConnectorSet) Method
Removes connectors from system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Remove(
	ConnectorSet connectors
)
Public Sub Remove (
	connectors As ConnectorSet
)
public:
void Remove(
	ConnectorSet^ connectors
)
member Remove :
        connectors : ConnectorSet -> unit
Parameters
connectors ConnectorSet
The connectors to be removed from the system.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument elements is null, or any element in that collection is null.
ArgumentException |  Thrown when some of the connectors can't be removed, or when trying to remove all connectors from the system.
InvalidOperationException |  Thrown when the operation failed.
See Also
Reference
MEPSystem Class
Remove Overload
Autodesk.Revit.DB Namespace